# Data Transformation and Visualization with Pandas

## Instructions:
This notebook contains a real-life dataset with dirty, malformed data, and outliers.
Your goal is to clean, transform, analyze, and visualize the data using **Pandas** and **Matplotlib**.

Complete the following tasks step by step. If you get stuck, refer to the [Pandas documentation](https://pandas.pydata.org/docs/) for help.

At the end of this notebook, the solutions will be provided. Attempt all tasks first before checking the solutions!

In [3]:
# Import required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import random

# ----------------------------
# 1. Generate a Dirty Dataset
# ----------------------------

In [4]:
np.random.seed(42)
random.seed(42)

In [5]:
# Create a dataframe with dirty data
data = {
    'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': [' Alice', 'BOB', 'Catherine', 'David ', 'Eve', 'frank', 'Gina', 'Henry', 'Ivy', 'Jack'],
    'Age': [23, 35, np.nan, 45, 29, 34, -1, 120, 25, 40],  # Missing and outlier values
    'Salary ($)': [50000, 60000, 75000, 80000, None, 120000, 45000, None, 70000, 62000],
    'Joining_Date': ['2021-01-15', '2020-06-10', '2023-03-01', '2020-12-10', None, '2019-08-20',
                     '2021-11-15', '2020-06-10', '2023-01-01', '2018-09-25'],
    'Department': ['HR', 'Sales', 'HR', 'IT', 'IT', 'Finance', 'Sales', 'Sales', 'HR', 'Finance'],
    'Performance_Score': ["A", "B", "C", "A", "B", "Invalid", "C", "A", "B", "A"]
}

In [6]:
# Create dataframe
df = pd.DataFrame(data)

In [7]:
# Introduce duplicate rows, malformed data, and extreme outliers
df.loc[10] = [10, 'Jack', 40, 62000, '2018-09-25', 'Finance', 'A']  # Duplicate row
df.loc[11] = [11, None, None, None, None, None, None]               # Malformed row
df.loc[12] = [12, 'Outlier', 200, 1000000, '2023-04-01', 'IT', 'A']  # Extreme outlier

In [8]:
# Display the initial dataset
print("Initial Dirty Dataset:")
display(df)

Initial Dirty Dataset:

,ID,Name,Age,Salary ($),Joining_Date,Department,Performance_Score
0,1.0,Alice,23.0,50000.0,2021-01-15,HR,A
1,2.0,BOB,35.0,60000.0,2020-06-10,Sales,B
2,3.0,Catherine,NaN,75000.0,2023-03-01,HR,C
3,4.0,David,45.0,80000.0,2020-12-10,IT,A
4,5.0,Eve,29.0,NaN,None,IT,B
5,6.0,frank,34.0,120000.0,2019-08-20,Finance,Invalid
6,7.0,Gina,-1.0,45000.0,2021-11-15,Sales,C
7,8.0,Henry,120.0,NaN,2020-06-10,Sales,A
8,9.0,Ivy,25.0,70000.0,2023-01-01,HR,B
9,10.0,Jack,40.0,62000.0,2018-09-25,Finance,A
10,10.0,Jack,40.0,62000.0,2018-09-25,Finance,A
11,11.0,NaN,NaN,NaN,NaN,NaN,NaN
12,12.0,Outlier,200.0,1000000.0,2023-04-01,IT,A

In [9]:
# Save the initial dataset as CSV (for later use)
df.to_csv('dirty_data.csv', index=False)

# -------------------------------------------------
# 2. Tasks for Students - Perform the following
# -------------------------------------------------


## TASK 1: Handle Missing Values
1. Replace all `NaN` values in the "Age" column with the mean age.
2. Replace all `NaN` values in the "Salary ($)" column with the median salary.
3. Drop rows where "Name" or "Joining_Date" are missing.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html

## TASK 2: Remove Duplicates
1. Identify duplicate rows.
2. Drop duplicate rows.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

## TASK 3: Clean Text Columns
1. Remove leading/trailing whitespaces from the "Name" column.
2. Convert all names to title case (e.g., 'alice' -> 'Alice').

Reference: https://pandas.pydata.org/docs/reference/api/pandas.Series.str.strip.html

## TASK 4: Handle Outliers
1. Visualize outliers in the "Age" and "Salary ($)" columns using boxplots.
2. Replace negative values in the "Age" column with the column's mean.
3. Cap the "Age" column values to 100.
4. Remove rows where the "Salary ($)" column is greater than 300,000.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.clip.html

## TASK 5: Data Type Conversion
1. Convert the "Joining_Date" column to datetime format.
2. Extract the year from the "Joining_Date" column and store it in a new column "Joining_Year".

Reference: https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

## TASK 6: Aggregation and GroupBy
1. Find the average "Salary" for each "Department".
2. Count the number of employees in each department.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

## TASK 7: Visualization with Matplotlib
1. Plot a bar chart showing average salary by department.
2. Plot a histogram of the "Age" column.
3. Plot a line chart showing the count of employees who joined each year.
4. Add a final step: Visualize the cleaned dataset's boxplots for "Age" and "Salary ($)" to confirm outliers are handled.

Reference: https://matplotlib.org/stable/gallery/index.html

## TASK 8: Extract Initials
1. Extract the first letter of each name and create a new column "Initial".

Reference: https://pandas.pydata.org/docs/reference/api/pandas.Series.str.html

## TASK 9: Replace Values in Columns
1. Replace "Invalid" in the "Performance_Score" column with "D".

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html

## TASK 10: Add Calculated Columns
1. Create a new column "Salary_in_Lacs" by dividing "Salary ($)" by 100,000.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.assign.html

## TASK 11: Normalize Salary
1. Normalize the "Salary ($)" column so that all values fall between 0 and 1.

Hint: Use min-max normalization.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.min.html

## TASK 12: Concatenate Columns
1. Create a new column "Name_Department" that combines "Name" and "Department".

Reference: https://pandas.pydata.org/docs/reference/api/pandas.Series.str.cat.html

## TASK 13: Filter Rows
1. Filter rows where "Salary ($)" is greater than 60000 and "Age" is less than 40.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.query.html

## TASK 14: Drop Columns
1. Drop the "ID" column from the dataset.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html

## TASK 15: Sort Data
1. Sort the dataset by "Age" in ascending order and "Salary ($)" in descending order.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html

## TASK 16: Create a Pivot Table
1. Create a pivot table that shows the average "Salary ($)" for each "Department" and "Performance_Score".

Reference: https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html

## TASK 17: Melt the DataFrame
1. Melt the dataset to unpivot "Age" and "Salary ($)" columns.

Reference: https://pandas.pydata.org/docs/reference/api/pandas.melt.html

## TASK 18: Apply a Function Row-wise
1. Create a new column "Salary_Category" based on salary:
   - "Low" if Salary < 50000
   - "Medium" if 50000 <= Salary < 80000
   - "High" if Salary >= 80000

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html